["What does a baby computer call his father? Data.",
"After an unsuccessful harvest, why did the farmer decide to try a career in music? Because he had a ton of sick beets.",
"I only seem to get sick on weekdays. I must have a weekend immune system.",
"What do you call a Frenchman wearing sandals? Philippe Flop.",
"Why is it so cheap to throw a party at a haunted house? Because the ghosts bring all the boos.",
"I don’t get why Marvel doesn’t use the Hulk to advertise more. He’s basically one big Banner.",
"What brand of underwear do scientists wear? Kelvin Klein.",
"Which days are the strongest? Saturday and Sunday. The rest are weekdays.",
"I just found out I’m colorblind. The news came out of the purple!",
"Did you know your pupils are the last part to stop working when you die? They dilate.",
"How do cows stay up to date? They read the Moo-spaper.",
"What's the difference between a well-dressed man on a unicycle and a poorly-dressed man on a bicycle? Attire.",
"I hate my job—all I do is crush cans all day. It’s soda pressing.",
"Where do pirates get their hooks? Second hand stores.",
"Of all the inventions of the last 100 years, the dry erase board has to be the most remarkable.",
"In America, using the metric system can get you in legal trouble.",
"What do you call a line of men waiting to get haircuts? A barberqueue.",
"In fact, if you sneer at any other method of measuring liquids, you may be held in contempt of quart.",
"Who were the greenest Presidents in US history? The bushes.",
"My hotel tried to charge me ten dollars extra for air conditioning. That wasn’t cool.",
"What do you call a beehive without an exit? Unbelievable.",
"If I ever find the doctor who screwed up my limb replacement surgery…I’ll kill him with my bear hands.",
"Did you know that the first french fries weren’t cooked in France? They were cooked in Greece.",
"It's easy to convince ladies not to eat Tide Pods, but harder to deter gents.",
"I asked my date to meet me at the gym but she never showed up. I guess the two of us aren't going to work out.",
"How do you find Will Smith in a snowstorm? You look for fresh prints.",
"The difference between a numerator and a denominator is a short line. Only a fraction of people will understand this",
"I found a wooden shoe in my toilet today. It was clogged.",
"I just broke up with my mathematician girlfriend. She was obsessed with an X.",
"I can't take my dog to the pond anymore because the ducks keep attacking him. That's what I get for buying a pure bread dog.",
"To whoever stole my copy of Microsoft Office, I will find you. You have my Word.",
"What’s Forrest Gump’s password? 1forrest1.",
"I used to run a dating service for chickens. But I was struggling to make hens meet.",
"If prisoners could take their own mug shots…They’d be called cellfies.",
"Have you heard about those new corduroy pillows? They're making headlines.",
"What do you call a bundle of hay in a church? Christian Bale.",
"Have you heard about the restaurant on the moon? Great food, no atmosphere.",
"I don't trust stairs. They're always up to something.",
"People in Athens rarely get up before sunrise. Dawn is tough on Greece.",
"Why'd the alternate universe Spider-Man do so well on his driving test? He's an excellent parallel Parker.",
"Never date a tennis player. Love means nothing to them.",
"What did Yoda say when he saw himself in 4K? HDMI.",
"What's blue and not very heavy? Light blue.",
"I don't get why bakers aren't wealthier. They make so much dough.",
"I asked my wife if I was the only one she slept with. She said yes—the others were 7’s and 8’s.",
"ow do flat-earthers travel? On a plane.",
"I ordered a chicken and an egg from Amazon. I'll let you know.",
"I was in a job interview the other day and they asked if I could perform under pressure. I said no, but I could perform 'Bohemian Rhapsody.'",
"I hate it when people say age is only a number. Age is clearly a word.",
"This year’s Fibonacci convention is going to be really special. Apparently it’s as big as the last two put together.",
"Not to brag but I made six figures last year. I was also named worst employee at the toy factory.",
"If you're feeling depressed, try drinking a gallon of water before you go to sleep. It'll give you a reason to get out of bed in the morning.",
"What has five toes and isn't your foot? My foot.",
"When I was a kid, my mother told me I could be anyone I wanted to be. Turns out, identity theft is a crime.",
"What's brown and sticky? A stick.",
"My doctor told me I was going deaf. The news was hard for me to hear.",
"I'm reading a horror story in braille. Something bad is going to happen, I can just feel it.",
"Anyone looking to buy a Delorean? Good shape, good mileage. Only driven from time to time",
"When I die, I want to be cremated. It’s my last chance to have a smokin’ hot body.",
"What do you call a sad cup of coffee? Depresso.",
"How come the Hulk doesn't lose his pants when he transforms? The experiment altered his jeans.",
"I didn't want to believe that my dad was stealing from his job as a traffic cop, but when I got home, all the signs were there.",
"What’s green and has wheels? Grass. I lied about the wheels.",
"What’s the best thing about living in Switzerland? I don’t know, but the flag is a big plus.",
"I tried to start a professional hide and seek team, but it didn't work out. Turns out, good players are hard to find.",
"Women should not have children after 36—really, 36 children is enough.",
"Lance isn't that common a name these days, but in medieval times, they were called lance-a-lot.",
"I used to be addicted to soap, but I’m clean now.",
"I wanted my kids to watch the orchestra, but I had to turn it off—too much sax and violins.",
"You used to be able to get air for free at gas stations, but now it's a $1. That's inflation for you.",
"My grief counselor died the other day. He was so good at his job, I don’t even care.",
"I was reading a great book about an immortal dog the other day. It was impossible to put down.",
"The guy who stole my diary just died. My thoughts are with his family.",
"What do you call bears with no ears? B.",
"My dad died because he couldn’t remember his blood type. He kept insisting we 'be positive,' but it’s just so hard without him.",
"Yesterday, I was washing the car with my son. He said, “Dad, can’t you just use a sponge?”",
"My friend was showing me his tool shed and pointed to a ladder. “That's my stepladder,” he said. 'I never knew my real ladder.'",
"My wife asked me the other day where I got so much candy. I said, 'I always have a few Twix up my sleeve.'",
"A panic-stricken man explained to his doctor, “You have to help me, I think I’m shrinking.” “Now settle down,” the doctor calmly told him. 'You'll just have to learn to be a little patient.'",
"I was playing chess with my friend and he said, “Let’s make this interesting.” So we stopped playing chess.",
"Someone complimented my parking today! They left a sweet note on my windshield that said “parking fine.”",
"I built a model of Mount Everest and my son asked if it was to scale. 'No,' I said. 'It's to look at.'",
"“Just say NO to drugs!” Well, if I’m talking to drugs, I probably already said yes.",
"I once saw a one-handed man in a second-hand store. I told him, “I don’t think they have what you’re looking for, sir.”"
]